# SSD with Mobilenet v1, configured for fisheye Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "/home/zj/my_workspace/fisheye_object_detect/data" to find the fields that
# should be configured.

model {
  ssd {
    num_classes: 2
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.1
        max_scale: 0.3
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        reduce_boxes_in_lowest_layer: false
      }
    }
    image_resizer {
      fixed_shape_resizer {
        height: 512
        width: 512
      }
    }
    box_predictor {
      retinanet_box_predictor {
        use_depthwise_before_predictor: true
        share_parameter: false
        min_depth: 8
        max_depth: 512
        num_layers_before_predictor: 2
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v1_retinanet'
      min_depth: 8
      depth_multiplier: 0.5
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      classification_loss {
        weighted_focal {
          alpha: 0.25
          gamma: 2.0
          anchorwise_output: true
        }
      }
      localization_loss {
        weighted_smooth_l1 {
          anchorwise_output: true
        }
      }
#      hard_example_miner {
#        num_hard_examples: 3000
#        iou_threshold: 0.99
#        loss_type: CLASSIFICATION
#        max_negatives_per_positive: 3
#        min_negatives_per_image: 1
#      }
      classification_weight: 2.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 20
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.004
          decay_steps: 2000
          decay_factor: 0.9
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "/home/zj/database/model/object_detect/ssd05focalvoc0117/model.ckpt"
  from_detection_checkpoint: true
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
  num_steps: 100000
  data_augmentation_options {
    resize_image {
      new_height: 600
      new_width: 600
    }
  }
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    random_rotate90 {
    }
  }
  data_augmentation_options {
    random_crop_pad_image {
      min_area: 0.8
      min_padded_size_ratio: 1.0
      min_padded_size_ratio: 1.0
      max_padded_size_ratio: 1.2
      max_padded_size_ratio: 1.2
      pad_color: 0.0
      pad_color: 0.0
      pad_color: 0.0
    }
  }

#  data_augmentation_options {
#    random_horizontal_flip {
#    }
#  }
#  data_augmentation_options {
#    ssd_random_crop {
#    }
#  }
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/home/zj/database_temp/fisheye2_data_set/train.record"
  }
  label_map_path: "/home/zj/database_temp/fisheye2_data_set/fisheye2_label_map.pbtxt"
}

eval_config: {
  num_visualizations: 20
  num_examples: 200
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
  # max_evals: 10
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/home/zj/database_temp/fisheye2_data_set/val.record"
  }
  label_map_path: "/home/zj/database_temp/fisheye2_data_set/fisheye2_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  queue_capacity: 50
  min_after_dequeue: 20
}

eval_train_input_reader: {
  tf_record_input_reader {
    input_path: "/home/zj/database_temp/fisheye2_data_set/train_origin.record"
  }
  label_map_path: "/home/zj/database_temp/fisheye2_data_set/fisheye2_label_map.pbtxt"
  shuffle: false
  num_readers: 1
  queue_capacity: 50
  min_after_dequeue: 20
}